In [2]:
import pandas as pd

import analysis.search as s

statement = pd.read_csv("statement.csv")
statement['date'] = pd.to_datetime(statement['date'])
#cname_u = input("Enter the category name: ")
#amt = float(input("Amount: "))
p = s.Search(statement)
#c = p.search_month("10")
c = p.search_year("2021")
#c = p.search_amount(amt)
#c = p.search_category(cname_u, "07/11/2022", "12/11/2022")
#c = p.search_amount(amt, "07/11/2022", "16/11/2022")
#c = p.search_range("26/11/2022", "23/11/2022")
print(c)

No records found
None

In [3]:
import pandas as pd

import analysis.analysis as a

statement = pd.read_csv("statement.csv")
statement['date'] = pd.to_datetime(statement['date'])

j = a.Analysis(statement, "02/11/2022", "26/11/2022")

In [2]:
j.income_expense_ratio_range(1000)

0.355

In [4]:
j.category_percentage()

          amount  percentage
category
fashion     3.55    2.979938
grocery    10.84    9.099303
NaN       104.74   87.920759

In [6]:
statement

        date                 shop_name  amount category
0 2022-11-26      SQ *SCAPEGOATVINTAGE   35.01      NaN
1 2022-11-23       SAVE ON FOODS #2229   10.84  grocery
2 2022-11-23    KELOWNA GOSPEL MISSION    6.40      NaN
3 2022-11-17  GOLDEN ISLAND RESTAURANT   36.50      NaN
4 2022-11-16     KOODO TOP UP REAPPROV   15.75      NaN
5 2022-11-07            MICHAELS #3929    3.55  fashion
6 2022-11-02       SAVE ON FOODS #2229   11.08      NaN

In [7]:
statement['amount'].sum()
(10/1000)*100

119.13

In [12]:
print(statement['category'].unique())

[nan 'grocery' 'fashion']

In [18]:
statement.groupby(["category"], dropna=False).sum()

          amount
category
fashion     3.55
grocery    10.84
NaN       104.74

In [19]:
statement['%'] = 100 * statement['amount'] / statement.groupby('category')['amount'].transform('sum')
statement

        date                 shop_name  amount category      %
0 2022-11-26      SQ *SCAPEGOATVINTAGE   35.01      NaN    NaN
1 2022-11-23       SAVE ON FOODS #2229   10.84  grocery  100.0
2 2022-11-23    KELOWNA GOSPEL MISSION    6.40      NaN    NaN
3 2022-11-17  GOLDEN ISLAND RESTAURANT   36.50      NaN    NaN
4 2022-11-16     KOODO TOP UP REAPPROV   15.75      NaN    NaN
5 2022-11-07            MICHAELS #3929    3.55  fashion  100.0
6 2022-11-02       SAVE ON FOODS #2229   11.08      NaN    NaN

In [4]:

# iterate over the rows of the dataframe
for index, row in statement.iterrows():
    # access data for each column by column name
    print(row['date'], row['shop_name'])
    input("ente")

2022-11-26 00:00:00 SQ *SCAPEGOATVINTAGE
2022-11-23 00:00:00 SAVE ON FOODS #2229
2022-11-23 00:00:00 KELOWNA GOSPEL MISSION
2022-11-17 00:00:00 GOLDEN ISLAND RESTAURANT
2022-11-16 00:00:00 KOODO TOP UP REAPPROV
2022-11-07 00:00:00 MICHAELS #3929
2022-11-02 00:00:00 SAVE ON FOODS #2229